ehcore-api-automation/src/test/resources/testfiles/adapters/allscripts/ccdimport/input/C-CCD_mockup_Allscripts_ICD10Patient-QBDoc93.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header/>
	<S:Body>
<AllscriptsMessageEnvelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://Allscripts.com/UAI/Schemas/2010/02/15">
	<MessageDispatchHeader>
		<ID xmlns="">8aa5d265-6875-44e7-b3f1-084b71d22a4e</ID>
		<Noun xmlns="">Encounter</Noun>
		<Verb xmlns="">Completed</Verb>
		<TimeStamp xmlns="">10/14/2010 10:33:18 AM</TimeStamp>
		<Originator xmlns=""/>
		<Destination xmlns=""/>
	</MessageDispatchHeader>
	<EntityContext>
		<KeyedValues>
			<KeyedValue>
				<Key>AccountID</Key>
				<Value>00000000000000099930</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>PatientID</Key>
				<Value>28121001</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>ProviderID</Key>
				<Value>91171</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>UserID</Key>
				<Value>91171</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>DestinationID</Key>
				<Value>Intuit</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>DestinationSiteID</Key>
				<Value>50</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>ReplyToMessageID</Key>
				<Value>0</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>DocumentID</Key>
				<Value>0</Value>
			</KeyedValue>
			<KeyedValue>
				<Key>ProductID</Key>
				<Value>PEHR</Value>
			</KeyedValue>
		</KeyedValues>
	</EntityContext>

	<MessageContent xmlns="">
		<EncounterData xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" SchemaName="EncounterData" xmlns="urn:Allscripts:Hub:PatientMsg">
			<PatientMsgBase ReceiptRequired="true">
				<MessageID xmlns="urn:Allscripts:mombt">8aa5d265-6875-44e7-b3f1-084b71d22a4e</MessageID>
				<ReplyToMessageID xmlns="urn:Allscripts:mombt"/>
				<Patient xmlns="urn:Allscripts:mombt">
					<Mrn>28121001</Mrn>
					<IDs>
						<CodeValue>45047</CodeValue>
						<CodeDescription>Intuit Patient</CodeDescription>
						<CodeType>Id</CodeType>
						<CodingSystem>Intuit</CodingSystem>
					</IDs>
				</Patient>
				<Provider xmlns="urn:Allscripts:mombt">
					<IDs>
						<CodeValue>91171</CodeValue>
						<CodeDescription>EEHR Provider ID</CodeDescription>
						<CodeType>EEHR</CodeType>
						<CodingSystem>Allscripts</CodingSystem>
					</IDs>
					<IDs>
						<CodeValue>57</CodeValue>
						<CodeDescription>Intuit Provider ID</CodeDescription>
						<CodeType>Id</CodeType>
						<CodingSystem>Intuit</CodingSystem>
					</IDs>
				</Provider>
			</PatientMsgBase>
			<ihe:CEDDocument xmlns:ihe="urn:Allscripts:ihe">
				<ihe:Xml>
				<![CDATA[
<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type='text/xsl' href='http://www.allscripts.com/resources/tools/STYLES/ALLSCRIPTS_CED.XSL'?>
<ClinicalDocument xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <realmCode code="US"/>
    <typeId extension="POCD_HD000040" root="2.16.840.1.113883.1.3"/>
    
    <!-- US General Header Template -->
	<templateId root="2.16.840.1.113883.10.20.22.1.1"/>
	<templateId root="2.16.840.1.113883.10.20.22.1.2"/>
	
    <id extension="3000204362" root="1.3.6.1.4.1.22812.3.99108.3.1"/>
    <code code="34133-9" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"
        displayName="SUMMARIZATION OF EPISODE NOTE"/>
    <title>Docs on Call Medical Summary</title>
    <effectiveTime value="20111227060817-0500"/>
    <confidentialityCode code="N" codeSystem="2.16.840.1.113883.5.25"/>
    <languageCode code="en-US"/>
    <recordTarget>
        <patientRole>
            <id extension="111220004943800" root="1.3.6.1.4.1.22812.3.99108.3"/>
            <addr>
                <streetAddressLine>patient</streetAddressLine>
                <streetAddressLine>own</streetAddressLine>
                <city>city</city>
                <state>NY</state>
                <postalCode>80205</postalCode>
                <country>US</country>
            </addr>
            <telecom value="tel:+1-(564)896-8957" use="HP"/>
            <patient>
                <name>
                    <given>ICD10</given>
                    <family>Patient</family>
                </name>
                <administrativeGenderCode code="M" codeSystem="2.16.840.1.113883.5.1"/>
                <birthTime value="19800604"/>
                <maritalStatusCode codeSystem="2.16.840.1.113883.5.2" code="S"
                    displayName="Never Married"/>
                <languageCommunication>
                    <templateId root="2.16.840.1.113883.3.88.11.32.2"/>
                    <templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.1"/>
                    <languageCode nullFlavor="UNK"/>
                </languageCommunication>
            </patient>
            <providerOrganization>
                <id extension="3" root="1.3.6.1.4.1.22812.3.99108.3"/>
                <name>Docs on Call</name>
                <telecom value="tel:+1-(970)255-1576" use="WP"/>
                <addr>
                    <streetAddressLine>3150 N 12th St</streetAddressLine>
                    <city>Grand Junction</city>
                    <state>OH</state>
                    <postalCode>81502-5517</postalCode>
                    <country>US</country>
                </addr>
            </providerOrganization>
        </patientRole>
    </recordTarget>
    <author>
        <time value="20111227060817-0500"/>
        <assignedAuthor>
            <id extension="5236987410" root="2.16.840.1.113883.4.6"/>
            <code code="SELF" codeSystem="2.16.840.1.113883.5.111" displayName="Self"
                codeSystemName="RoleCode"/>
            <addr nullFlavor="UNK"/>
            <telecom value="tel:+1-(970)255-1576" use="WP"/>
            <telecom value="mailto:cardioprov@allscripts.com" use="WP"/>
            <assignedPerson>
                <name>
                    <given>Cardiologist</given>
                    <family>Allscripts</family>
                </name>
            </assignedPerson>
        </assignedAuthor>
    </author>
    <author>
        <time value="20111227060817-0500"/>
        <assignedAuthor>
            <id extension="3" root="1.3.6.1.4.1.22812.3.99108.3.3.3"/>
            <addr>
                <streetAddressLine>3150 N 12th St</streetAddressLine>
                <city>Grand Junction</city>
                <state>OH</state>
                <postalCode>81502-5517</postalCode>
                <country>US</country>
            </addr>
            <telecom value="tel:+1-(970)255-1576" use="WP"/>
            <assignedAuthoringDevice>
                <softwareName>Enterprise EHR 11.400.4376.22053; Transform 3.5.0.3</softwareName>
            </assignedAuthoringDevice>
            <representedOrganization>
                <id extension="3" root="1.3.6.1.4.1.22812.3.99108.3"/>
                <name>Docs on Call</name>
                <telecom value="tel:+1-(970)255-1576" use="WP"/>
                <addr>
                    <streetAddressLine>3150 N 12th St</streetAddressLine>
                    <city>Grand Junction</city>
                    <state>OH</state>
                    <postalCode>81502-5517</postalCode>
                    <country>US</country>
                </addr>
            </representedOrganization>
        </assignedAuthor>
    </author>
    <custodian>
        <assignedCustodian>
            <representedCustodianOrganization>
                <id extension="3" root="1.3.6.1.4.1.22812.3.99108.3"/>
                <name>Docs on Call</name>
                <telecom value="tel:+1-(970)255-1576" use="WP"/>
                <addr>
                    <streetAddressLine>3150 N 12th St</streetAddressLine>
                    <city>Grand Junction</city>
                    <state>OH</state>
                    <postalCode>81502-5517</postalCode>
                    <country>US</country>
                </addr>
            </representedCustodianOrganization>
        </assignedCustodian>
    </custodian>
    <informationRecipient>
        <intendedRecipient>
            <id extension="3" root="1.3.6.1.4.1.22812.3.99108.3.3.1"/>
            <addr>
                <streetAddressLine>3150 N 12th St</streetAddressLine>
                <city>Grand Junction</city>
                <state>OH</state>
                <postalCode>81502-5517</postalCode>
                <country>US</country>
            </addr>
            <telecom value="tel:+1-(970)255-1576" use="WP"/>
            <receivedOrganization>
                <name>Docs on Call</name>
                <telecom value="tel:+1-(970)255-1576" use="WP"/>
                <addr>
                    <streetAddressLine>3150 N 12th St</streetAddressLine>
                    <city>Grand Junction</city>
                    <state>OH</state>
                    <postalCode>81502-5517</postalCode>
                    <country>US</country>
                </addr>
            </receivedOrganization>
        </intendedRecipient>
    </informationRecipient>
    <authenticator>
        <time value="20111227060817-0500"/>
        <signatureCode code="S"/>
        <assignedEntity>
            <id extension="91171" root="1.3.6.1.4.1.22812.3.99108.3"/>
            <addr nullFlavor="UNK"/>
            <telecom value="tel:+1-(970)255-1576" use="WP"/>
            <telecom value="mailto:cardioprov@allscripts.com" use="WP"/>
            <assignedPerson>
                <name>
                    <given>Cardiologist</given>
                    <family>Allscripts</family>
                </name>
            </assignedPerson>
        </assignedEntity>
    </authenticator>
    <participant typeCode="IND">
        <templateId root="2.16.840.1.113883.3.88.11.32.3"/>
        <templateId root="2.16.840.1.113883.3.88.11.83.3"/>
        <templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.4"/>
        <time value="20111227060817-0500"/>
        <associatedEntity classCode="CAREGIVER">
            <id root="1.3.6.1.4.1.22812.3.99108.3.3.2.1"/>
            <code code="FRND" displayName=" Unrelated Friend" codeSystem="2.16.840.1.113883.5.111"
                codeSystemName="RoleCode"/>
            <addr>
                <streetAddressLine>#32, Eagle ridge, building block</streetAddressLine>
                <streetAddressLine>layout</streetAddressLine>
                <city>illinois</city>
                <state>IL</state>
                <postalCode>6666666</postalCode>
                <country>US</country>
            </addr>
            <telecom value="tel:+1-(970)245-1221" use="WP"/>
            <telecom value="mailto:niaz@doctor.com" use="WP"/>
            <associatedPerson>
                <name>
                    <given>Abdul</given>
                    <family>Ahmed</family>
                </name>
            </associatedPerson>
        </associatedEntity>
    </participant>
    <documentationOf>
        <serviceEvent classCode="PCPR">
            <id extension="1130484" root="1.3.6.1.4.1.22812.3.99108.3.3.8"/>
            <effectiveTime>
                <low value="20111227034500+0000"/>
                <high value="20111227060817-0500"/>
            </effectiveTime>
            <performer typeCode="PRF">
                <templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.3"/>
                <templateId root="2.16.840.1.113883.3.88.11.32.4"/>
                <templateId root="2.16.840.1.113883.3.88.11.83.4"/>
                <functionCode code="PP" codeSystem="2.16.840.1.113883.12.443"/>
                <time>
                    <low/>
                    <high/>
                </time>
                <assignedEntity>
                    <id extension="1223456789" root="2.16.840.1.113883.4.6"/>
                    <code codeSystem="2.16.840.1.113883.6.101" codeSystemName="ProviderCodes"
                        code="260000000X" displayName="Ambulatory Health Care Facilities"/>
                    <addr>
                        <streetAddressLine>#32, Eagle ridge, building block</streetAddressLine>
                        <streetAddressLine>layout</streetAddressLine>
                        <city>illinois</city>
                        <state>IL</state>
                        <postalCode>6666666</postalCode>
                        <country>US</country>
                    </addr>
                    <telecom value="tel:+1-(970)245-1221" use="WP"/>
                    <telecom value="mailto:niaz@doctor.com" use="WP"/>
                    <assignedPerson>
                        <name>
                            <given>Abdul</given>
                            <family>Ahmed</family>
                        </name>
                    </assignedPerson>
                </assignedEntity>
            </performer>
            <performer typeCode="PRF">
                <templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.3"/>
                <templateId root="2.16.840.1.113883.3.88.11.32.4"/>
                <templateId root="2.16.840.1.113883.3.88.11.83.4"/>
                <functionCode code="PP" codeSystem="2.16.840.1.113883.12.443"/>
                <time>
                    <low/>
                    <high/>
                </time>
                <assignedEntity>
                    <id extension="5236987410" root="2.16.840.1.113883.4.6"/>
                    <code codeSystem="2.16.840.1.113883.6.101" codeSystemName="ProviderCodes"
                        code="260000000X" displayName="Ambulatory Health Care Facilities"/>
                    <addr nullFlavor="UNK"/>
                    <telecom value="tel:+1-(970)255-1576" use="WP"/>
                    <telecom value="mailto:cardioprov@allscripts.com" use="WP"/>
                    <assignedPerson>
                        <name>
                            <given>Cardiologist</given>
                            <family>Allscripts</family>
                        </name>
                    </assignedPerson>
                </assignedEntity>
            </performer>
            <performer typeCode="PPRF">
                <templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.3"/>
                <time>
                    <low/>
                    <high/>
                </time>
                <assignedEntity classCode="ASSIGNED">
                    <id extension="ATNAFL" root="1.3.6.1.4.1.22812.3.99108.3.3.6"/>
                    <code code="PHARMACY" codeSystem="1.3.5.1.4.1.19376.1.5.3.3"
                        codeSystemName="IHERoleCode"/>
                    <addr nullFlavor="UNK"/>
                    <telecom value="tel:+1-(800)823-7252" use="WP"/>
                    <representedOrganization>
                        <name>AETNA Florida</name>
                        <telecom value="tel:+1-(800)823-7252" use="WP"/>
                        <addr nullFlavor="UNK"/>
                    </representedOrganization>
                </assignedEntity>
            </performer>
        </serviceEvent>
    </documentationOf>
    <componentOf>
        <encompassingEncounter>
            <id extension="1130484" root="1.3.6.1.4.1.22812.3.99108.3.3.4"/>
            <effectiveTime>
                <low value="20111227034500+0000"/>
                <high value="20111227060817-0500"/>
            </effectiveTime>
        </encompassingEncounter>
    </componentOf>
    <component>
        <structuredBody>
            <templateId extension="IMPL_CDAR2_LEVEL1" root="2.16.840.1.113883.10"/>
            <component>
                <section>
               		 <templateId root="1.3.6.1.4.1.19376.1.5.3.1.3.1"/>
                    <id root="1.3.6.1.4.1.22812.3.99108.3.5" extension="15"/>
                    <code code="42349-1" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"
                        displayName="Reason for Referral"/>
                    <title>Reason for Referral</title>
                    <text>No Reason for Referral was given.</text>
                </section>
            </component>
            <component>
                <section>
                	<!--  Same templateID -->
                    <templateId root="1.3.6.1.4.1.19376.1.5.3.1.3.4"/>
                    <id root="1.3.6.1.4.1.22812.3.99108.3.5" extension="20"/>
                    <code code="10164-2" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC"
                        displayName="HPI"/>
                    <title>History of Present Illness</title>
                    <text>No HPI available.</text>
                </section>
            </component>
            
             
             
                    
        </structuredBody>
    </component>
</ClinicalDocument>
]]>

				</ihe:Xml>
				<ihe:Html>

&lt;html&gt;
	&lt;body&gt;
		&lt;h1&gt;You should not see this content&lt;/h1&gt;
	&lt;/body&gt;
&lt;/html&gt;

				</ihe:Html>
				<ihe:MimeType>text/xml</ihe:MimeType>
				<ihe:DocType>CCD</ihe:DocType>
				<ihe:B64NonXmlBody/>
				<ihe:MediaType/>
				<ihe:Id>1.3.6.1.4.1.22812.3.99930.3.1.51556762</ihe:Id>
				<ihe:SourceID>1.3.6.1.4.1.22812.3.99930.3.3</ihe:SourceID>
				<ihe:PatientLastName>Reed</ihe:PatientLastName>
				<ihe:PatientFirstname>Allison</ihe:PatientFirstname>
				<ihe:PatientMiddleName/>
				<ihe:PatientAddressLine1/>
				<ihe:PatientAddressLine2/>
				<ihe:PatientCity/>
				<ihe:PatientState/>
				<ihe:PatientZip/>
				<ihe:PatientSex>M</ihe:PatientSex>
				<ihe:PatientHomePhone/>
				<ihe:PatientDOB>19550205</ihe:PatientDOB>
				<ihe:PatientID>101010063116483</ihe:PatientID>
			</ihe:CEDDocument>
		</EncounterData>
	</MessageContent>
</AllscriptsMessageEnvelope>
	</S:Body>
</S:Envelope>
